package edu.hanyang.trip_planning.optimize.evaluation;

/**
 * Created by wykwon on 2015-11-26.
 */
public class EvaluationSet {
    public static final String jeju10_1[] = {"제주KAL호텔", "환상숲곶자왈공원", "백약이오름", "화순금모래해변", "유리의성", "두산봉", "외돌개", "제주서광다원", "우도", "삼성혈"};
    public static final String jeju10_2[] = {"제주신라호텔", "중문색달해변", "백약이오름", "오설록티뮤지엄", "비자림", "비양도", "용눈이오름", "용연구름다리", "새섬", "외돌개"};
    public static final String jeju10_3[] = {"제주신라호텔", "남원큰엉해안경승지", "일출랜드", "협재해변", "휴애리", "한라산 어승생악", "산방산", "붉은오름자연휴양림", "두산봉", "제주민속촌박물관"};
    public static final String jeju10_4[] = {"메종글래드제주", "천지연폭포", "화순금모래해변", "협재해변", "김영갑갤러리두모악", "제주민속촌박물관", "제주마방목지", "제주해녀박물관", "산방산탄산온천", "송악공원"};
    public static final String jeju10_5[] = {"메종글래드제주", "곽지과물해변", "이중섭미술관", "제주도립미술관", "아부오름", "비자림", "용눈이오름", "따라비오름", "송악공원", "성산일출봉"};
    public static final String jeju10_6[] = {"빌로우비치호텔", "박물관은살아있다 제주중문점", "두산봉", "소인국테마파크", "도순설록다원", "성읍민속마을", "용두암", "용연구름다리", "여미지식물원", "오설록티뮤지엄"};
    public static final String jeju10_7[] = {"제주신라호텔", "송악산", "송악공원", "만장굴", "쇠소깍", "감귤 박물관", "차귀도", "한라수목원", "수월봉", "한라산국립공원 관음사탐방로"};
    public static final String jeju10_8[] = {"제주KAL호텔", "제주도립미술관", "중문색달해변", "휴애리", "송악공원", "우도팔경유람선", "비자림", "성읍민속마을", "메이즈랜드", "한라산국립공원 영실탐방로"};
    public static final String jeju10_9[] = {"빌로우비치호텔", "용눈이오름", "성산일출봉", "천제연폭포", "한라산국립공원 돈내코탐방로", "대정향교", "제주현대미술관", "제주절물자연휴양림", "삼성혈", "한라수목원"};
    public static final String jeju10_10[] = {"빌로우비치호텔", "요트투어샹그릴라", "사라봉", "서귀포자연휴양림", "넥슨컴퓨터박물관", "테디베어뮤지엄 제주점", "산굼부리", "소인국테마파크", "관덕정", "휴애리"};
    public static final String jeju10_11[] = {"메종글래드제주", "넥슨컴퓨터박물관", "오설록티뮤지엄", "성읍민속마을", "삼성혈", "만장굴", "한화아쿠아플라넷 제주", "따라비오름", "제주민속촌박물관", "유리의성"};
    public static final String jeju10_12[] = {"제주신라호텔", "돈내코유원지", "산방산", "소인국테마파크", "산굼부리", "한라산 웃세붉은오름", "만장굴", "함덕서우봉해변", "안덕계곡", "곽지과물해변"};
    public static final String jeju10_13[] = {"메종글래드제주", "사계해변", "대정향교", "지미봉", "저지오름", "제주공룡랜드", "용두암", "사라봉", "외돌개", "사려니숲길"};
    public static final String jeju10_14[] = {"제주KAL호텔", "협재해변", "테디베어뮤지엄 제주점", "함덕서우봉해변", "한라산국립공원 영실탐방로", "관음사", "성읍민속마을", "메이즈랜드", "차귀도", "화순금모래해변"};
    public static final String jeju10_15[] = {"제주KAL호텔", "제주서광다원", "노루생태관찰원", "한라산 웃세붉은오름", "곽지과물해변", "신산공원", "협재해변", "동백동산", "퍼시픽랜드 돌고래쇼", "성읍민속마을"};
    public static final String jeju10_16[] = {"제주KAL호텔", "산굼부리", "성산일출봉", "새섬", "이중섭미술관", "비양도", "소인국테마파크", "다랑쉬", "메이즈랜드", "제주절물자연휴양림"};
    public static final String jeju10_17[] = {"제주신라호텔", "소인국테마파크", "서귀포자연휴양림", "관음사", "제주절물자연휴양림", "신산공원", "감귤 박물관", "돈내코유원지", "요트투어샹그릴라", "미로공원"};
    public static final String jeju10_18[] = {"제주신라호텔", "화순금모래해변", "정방폭포", "김영갑갤러리두모악", "요트투어샹그릴라", "소정방폭포", "사려니숲길", "제주도립미술관", "월정리해수욕장", "만장굴"};
    public static final String jeju10_19[] = {"빌로우비치호텔", "만장굴", "유리의성", "두산봉", "서귀포자연휴양림", "여미지식물원", "남원큰엉해안경승지", "한라산국립공원 어리목탐방로", "사라봉", "엉또폭포"};
    public static final String jeju10_20[] = {"제주신라호텔", "신산공원", "알뜨르비행장", "용연구름다리", "한라산국립공원 관음사탐방로", "소정방폭포", "한림공원", "이호테우해변", "한라산국립공원 영실탐방로", "삼양검은모래해변"};
}
